Revit 2024 API
SymbolTypeId.DegreeF Property
 Symbol °F, indicating unit Fahrenheit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DegreeF { get; }
Visual Basic
Public Shared ReadOnly Property DegreeF As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DegreeF {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace